Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །སཱ་ལའི་དབང་པོ་རྒྱལ་ལ་མར་ཕུལ་མེ་ཏོག་རྒྱས་ལ་འོ་མ་ཕུལ།
en: To Śālendrarāja you offered clarified butter, and milk to Puṣpita.

source: །གྲགས་སྦྱིན་ཀུན་དའི་མེ་ཏོག་ཕུལ་ཏེ་བདེན་པ་གཟིགས་ལ་ཞལ་ཟས་ཕུལ།
en: To Yaśodatta you offered kuruṇṭa flowers, and food to Satyadarśin.

source: །ཡེ་ཤེས་ལྷུན་ལ་ལུས་བཏུད་ཀླུས་བྱིན་ལ་ནི་ན་བཟའ་དབུལ་བ་བྱས།
en: You bowed down to Jñānameru, and offered robes to Nāgadatta.

source: །རབ་མཐོར་གཤེགས་དང་ཙན་དན་མཆོག་དང་འོད་ལྡན་ལ་ནི་ཚྭ་སྤར་རེ།
en: “To Atyuccagāmin you offered the finest sandalwood, and a handful of salt to Tiṣya.

source: །བཀོད་པ་ཆེ་ལ་པད་མ་དབུལ་བྱས་འོད་ཟེར་རྒྱལ་ལ་རིན་ཆེན་ཕུལ།
en: You offered lotus flowers to Mahāvyūha, and jewels to Raśmirāja.

source: །ཤཱཀྱ་ཐུབ་ལ་སྤར་གང་གསེར་ཕུལ་དབང་པོའི་ཏོག་ལ་བསྟོད་པ་བྱས།
en: To Śākyamuni you offered a handful of gold, and you praised Indraketu.

source: །ཉི་མའི་ཞལ་ལ་མེ་ཏོག་རྣ་རྒྱན་བློ་གྲོས་བཟང་ལ་གསེར་ཅོད་པན།
en: You offered earrings to Sūryānanda, and a golden crown to Sumati.

source: །ཀླུ་ཟིལ་གནོན་ལ་ནོར་བུ་ཕུལ་ཏེ་རྒྱལ་ལ་རས་བཅོས་གདིང་བ་ཕུལ།
en: “To Nāgābhibhū you offered a jewel, and a cotton mat to Puṣya.

source: །སྨན་གྱི་རྒྱལ་ལ་རིན་ཆེན་གདུགས་ཕུལ་སེང་གེའི་ཏོག་ལ་ཁྲི་གདན་ཕུལ།
en: To Bhaiṣajyarāja you offered a precious parasol, and a throne to Siṃhaketu.

source: །ཡོན་ཏན་མཆོག་ལྡན་རིན་ཆེན་དྲ་བ་འོད་སྲུང་ལ་ནི་གླུ་དབྱངས་ཀུན།
en: You offered Guṅāgradhāri a net of precious stones, and instruments to Kāśyapa.

source: །སྤོས་མཆོག་མེ་ཏོག་ཕུལ་ཞིང་འོད་འཕྲོའི་ཏོག་ལ་རྟག་ཏུ་མེ་ཏོག་ཕུལ།
en: To Arciketu you offered powders of exquisite scent, and flowers to Caityaka.

source: །མི་འཁྲུགས་རྒྱལ་ལ་ཁང་བརྩེགས་ཕུལ་ཞིང་འཇིག་རྟེན་མཆོད་ལ་ཕྲེང་བ་ཕུལ།
en: “You offered Akṣobhyarāja a multistoried palace, and a flower garland to Lokapūjita.

source: །རྒྱ་སྤོས་གཙུག་ལག་རྒྱལ་སྲིད་དབུལ་བྱས་རྒྱལ་བར་དགའ་ལ་སྤོས་ཀུན་ཕུལ།
en: To Tagaraśikhin you offered your kingdom, and to Durjaya much incense.

source: །སྒྲོན་མ་ཆེ་ལ་བདག་ཕུལ་པད་མའི་མཆོག་ལ་རྒྱན་རྣམས་དབུལ་བ་བྱས།
en: You offered yourself to Mahāpradīpa, and jewel adornments to Padmottara.

source: །ཆོས་ཀྱི་ཏོག་ལ་མེ་ཏོག་སྣ་ཚོགས་སྒྲོན་མ་མཛད་ལ་ཨུད་པ་ལ། །མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་ཐ་དད་གཞན་དང་གཞན་དག་བྱེད་པ་ན།
en: To Dharmaketu you offered various flowers, and blue lotuses to Dīpaṃkara.

source: །ཁྱོད་ཀྱིས་སེམས་ཅན་སྙིང་པོ་དེ་དག་རྣམས་དང་གཞན་ཡང་སྔོན་ཆད་མཆོད།
en: “In the past you made these and other offerings, Manifold and marvelous, to the best of beings.

source: །འདས་པའི་སངས་རྒྱས་རྣམས་དང་སྟོན་པ་དེ་དག་ཁྱོད་མཆོད་དྲན་པར་གྱིས།
en: Remember the buddhas of the past and your offerings to these teachers.

source: །སེམས་ཅན་མགོན་མེད་མྱ་ངན་གང་བ་ཡལ་བར་མ་དོར་མངོན་པར་བྱུང་།
en: Do not abandon those who suffer without protection; leave your home.

source: །མར་མེ་མཛད་པ་མཐོང་བ་ཙམ་གྱིས་ཁྱོད་ཀྱིས་བཟོད་པ་མཆོག་ཐོབ་སྟེ།
en: “Merely seeing Dīpaṃkara, you attained supreme forbearance,

source: །རྗེས་སུ་འཐུན་པའི་མངོན་པར་ཤེས་པ་ལྔ་པོ་ཉམས་པ་མེད་པ་ཐོབ།
en: And discovered, accordingly, the five indestructible clairvoyant perceptions.

source: །དེ་ནས་རབ་ཏུ་དགའ་བས་བསྐལ་པ་གྲངས་མེད་འཇིག་རྟེན་ཁམས་ཀུན་དུ།
en: Subsequently you performed inconceivable offerings

source: །སངས་རྒྱས་དག་ནི་རེ་རེ་ལ་ཡང་མཆོད་པ་བསམ་གྱིས་མི་ཁྱབ་བྱས།
en: For limitless eons to all the buddhas in all the universes.

source: །བསྐལ་པ་དཔག་མེད་དེ་དག་ཟད་གྱུར་སངས་རྒྱས་དེ་དག་མྱ་ངན་འདས།
en: “Now limitless eons have passed, and those buddhas have passed into nirvāṇa.

source: །ཁྱོད་ཀྱི་ལུས་རྣམས་ཐམས་ཅད་དང་ནི་དེ་དག་མིང་ཡང་གང་དུ་སོང་།
en: Where are all your past bodies and names now?

source: །དངོས་པོ་ཐམས་ཅད་ཐ་མར་འཛད་པའི་ཆོས་ཏེ་འདུས་བྱས་རྟག་པ་མེད།
en: All things perish by nature; there is no permanence in conditioned things.

source: །འདོད་པ་རྒྱལ་སྲིད་ལོངས་སྤྱོད་རྟག་པ་མིན་གྱིས་གྲོང་ཁྱེར་མཆོག་ནས་བྱུང་།
en: Delights, kingdoms, and enjoyments are impermanent, so leave this perfect city.

source: །བསྐལ་པ་ཟད་པར་འགྱུར་ཚེ་གཟི་བརྗིད་དྲག་པོ་འཇིགས་པའི་མེ་འོད་ལྟར།
en: “Like the fierce and terrifying inferno, when this eon comes to an end,

source: །རྒ་དང་ན་དང་འཆི་བ་མི་བཟད་འཇིགས་པ་ཆེན་པོ་འོང་བར་འགྱུར།
en: Old age, sickness, and death bring great and terrible fear.

source: །ཤིན་ཏུ་སྡུག་བསྔལ་སེམས་ཅན་ལྟོས་ལ་ཡོན་ཏན་ལྡན་པ་མངོན་པར་བྱུང་།
en: Look at those who suffer intensely and, Capable One, renounce.”

source: །རྒྱལ་པོ་བདེ་བའི་མལ་ན་ཉལ་གྱུར་ཅིང་། །གང་ཚེ་མོ་ཚོགས་གླིང་བུ་རྒྱུད་གཅིག་དང་། །སིལ་སྙན་སྣ་ཚོགས་སྒྲ་ཡིས་སློང་བྱེད་པ། །དེ་ཚེ་སིལ་སྙན་སྒྲ་ལས་འདི་དག་བྱུང་།
en: As the retinue of women wake up the Lord of Men, Who was resting in his comfortable bed, With sounds of lutes, flutes, and other instruments, At that time the following words come from within the sounds of the instruments:

source: །སྲིད་གསུམ་རྒ་དང་ནད་ཀྱི་སྡུག་བསྔལ་འབར།
en: “The three worlds are ablaze with the suffering of old age and sickness;

source: །འཆི་མེ་རབ་འབར་འདི་ནི་མགོན་མེད་པ།
en: This world is ablaze with the fire of death and without a protector.

source: །སྲིད་ལས་འབྱུང་ལ་འགྲོ་བ་རྟག་ཏུ་རྨོངས།
en: Always deluded in impure existence,

source: །བུམ་པར་ཆུད་པའི་བུང་བ་འཁོར་བ་བཞིན།
en: Beings spin like a bee caught in a vase.

source: །སྲིད་གསུམ་མི་བརྟན་སྟོན་ཀའི་སྤྲིན་དང་འདྲ།
en: “The three worlds are unstable, like autumn clouds;

source: །འགྲོ་བའི་སྐྱེ་འཆི་གར་ལ་ལྟ་དང་མཚུངས།
en: The birth and death of beings is like watching a play.

source: །འགྲོ་བའི་ཚེ་འགྲོ་ནམ་མཁའི་གློག་འདྲ་སྟེ། །རི་གཟར་འབབ་ཆུ་ལྟ་བུར་མྱུར་མགྱོགས་འགྲོ།
en: The life of a being passes quickly, Like a lightning bolt in the sky or a mountain stream.

source: །སྲིད་སྲེད་མ་རིག་དབང་གིས་སྐྱེ་བོ་རྣམས།
en: “By the power of craving for existence and ignorance,

source: །མི་དང་ལྷ་གནས་ངན་སོང་ལམ་གསུམ་པོ།
en: Beings take birth as humans, gods, or in the three lower realms.

source: །འགྲོ་བ་ལྔ་པོ་དག་ཏུ་མི་མཁས་འཁོར།
en: In their ignorance they continuously circle among these five existences,

source: །དཔེར་ན་རྫ་མཁན་ཕང་ལོ་བསྐོར་བ་བཞིན།
en: Like the spinning of a potter’s wheel.

source: །རྟག་ཏུ་གཟུགས་སྡུག་མཆོག་དང་སྒྲ་སྙན་དང་། །དྲི་ཞིམ་རོ་མཆོག་རེག་པ་བདེ་བྱེད་པ།
en: “Beautiful forms, sweet sounds, fragrant smells, Delicious tastes, and pleasant touch—

source: །དུས་ངན་རྙི་ལ་འགྲོ་བ་འདི་དག་ཐོགས།
en: The snare of these unfortunate times has caught beings,

source: །དཔེར་ན་རྔོན་པའི་རྙི་ལ་སྤྲེའུ་ཐོགས་བཞིན།
en: Like the hunter’s snare catches a monkey.

source: །འདོད་པའི་ཡོན་ཏན་མྱ་ངན་གནོད་པ་མང་།
en: “The objects of enjoyment lead to much suffering and harm;

source: །འཇིགས་བཅས་རྟག་ཏུ་དགྲ་བྱེད་ཉོན་མོངས་བཅས།
en: They bring fear, make enemies, and lead to depravity.

source: །རལ་གྲི་སོ་འདྲ་དུག་སྡོང་ལོ་མ་མཚུངས། །ངན་སྐྱུགས་སྣོད་ལྟར་འཕགས་པའི་སྐྱེ་བོས་སྤངས།
en: A noble being will reject them like a bowl of excrement, The edge of a sword, or poison ivy.

source: །འདོད་པའི་ཡོན་ཏན་འཇིགས་བཅས་ཉོན་མོངས་བཅས།
en: “The objects of enjoyment always bring fear and depravity;

source: །རྟག་ཏུ་རྗེད་པར་བྱེད་པ་མུན་པ་འདྲ།
en: They make us suffer when we think of them, and they make us blind.

source: །རྟག་ཏུ་འཇིགས་པའི་རྒྱུ་བྱེད་སྡུག་བསྔལ་རྩ།
en: They always produce causes of fear and are the root of suffering;

source: །སྲིད་པའི་སྲེད་པའི་འཁྲི་ཤིང་འཕེལ་བར་བྱེད།
en: They make the vine of craving for existence grow.

source: །ཇི་ལྟར་མེ་འབར་འོབས་ནི་འཇིགས་བཅས་པ།
en: “Just like a terrifying fire pit,

source: །དེ་ལྟར་འདོད་འདི་འཕགས་པའི་སྐྱེ་བོས་རིག །འདམ་རྫབ་ཆེ་འདྲ་རལ་གྲི་གཤེགས་གནས་འདྲ།
en: So the noble ones understand desire. Or they see it like a great swamp, or like walking on swords,

source: །རལ་གྲིའི་སོ་ལ་སྦྲང་རྩིས་བསྐུས་དང་མཚུངས།
en: Or like the edge of a knife smeared with honey.

source: །ཇི་ལྟར་སྦྲུལ་གྱི་མགོ་དང་ངན་སྐྱུགས་སྣོད།
en: “Like a viper’s head or a bowl of excrement,

source: །དེ་ལྟར་འདོད་འདི་མཁས་པ་རྣམས་ཀྱིས་རིག །བྱ་ཤ་ཁམ་བུ་འདྲ་ཞིང་གསལ་ཤིང་འདྲ།
en: So the wise ones understand desire. Desires are like a pang of pain, and as fragile as a bird’s egg;

source: །རོ་ལ་ཁྱི་ལྟར་དགྲ་དང་བཅས་པ་ཡིན།
en: Like a bone among dogs, they are the prime cause of enmity.

source: །འདོད་པའི་ཡོན་ཏན་འདི་དག་ཆུ་ཟླ་འདྲ།
en: “Desired objects are like a moon reflected in water,

source: །གཟུགས་བརྙན་མཚུངས་ཤིང་བྲག་ཅ་འདྲ་བ་དང་། །མིག་ཡོར་འདྲ་ཞིང་གར་ལ་ལྟ་འདྲ་དང་། །རྨི་ལམ་མཉམ་པར་འཕགས་པའི་སྐྱེ་བོས་རིག །འདོད་པའི་ཡོན་ཏན་སྐད་ཅིག་ཡ་མ་བརླ།
en: Like a reflection, or an echo, Like an illusion, or like a theater play, Or like a dream—thus perceive the noble ones. “Desired objects are momentary and empty.

source: །སྒྱུ་མ་སྨིག་རྒྱུ་འདྲ་ཞིང་བརྫུན་པ་ཅན།
en: They are as untrue as a magical illusion or a mirage;

source: །ཆུ་བུར་དབུ་བ་ལྟ་བུ་ཡང་དག་མིན།
en: They have no substance, like a bubble of water or foam.

source: །ཡོངས་སུ་བཏགས་ལས་བྱུང་བར་མཁས་པས་རྟོགས།
en: The learned ones realize that these objects emerge from conceptualization.

source: །ན་ཚོད་ཐོག་མར་གཟུགས་མཆོག་འཛིན་པའི་ཚེ།
en: “At first in youth, when one has a fine body,

source: །ཕངས་ཤིང་སྡུག་འདོད་འདི་ནི་བྱིས་པའི་སྤྱོད།
en: One is liked and desired and acts like a child.

source: །རྒ་ན་སྡུག་བསྔལ་གཟི་བརྗིད་ལུས་བཅོམ་ནས།
en: Yet when old age, suffering, and diseases conquer the splendor of the body,

source: །རྣམ་པར་སྤོང་སྟེ་རི་དགས་ཀླུང་སྐམ་བཞིན།
en: One is abandoned, just like a dried-up river is abandoned by deer.

source: །ནོར་འབྲུ་དམ་པ་རྫས་མང་སྟོབས་ལྡན་ཚེ།
en: “When one is powerful with the best of wealth, grains, and possessions,

source: །ནོར་ཉམས་སྡུག་བསྔལ་བར་ནི་གྱུར་པའི་ཚེ།
en: Yet when the wealth is spent and suffering sets in,

source: །རྣམ་པར་སྤོང་སྟེ་མི་ཡིས་འབྲོག་སྟོང་བཞིན།
en: One is abandoned, just like an empty wilderness.

source: །ཇི་ལྟར་མེ་ཏོག་ཤིང་དང་འབྲས་བཅས་ཤིང་།
en: “Like a tree with flowers and fruits,

source: །དེ་ལྟར་སྦྱིན་འདོད་མི་ལ་དགའ་བར་བྱེད།
en: People love a person who delights in giving.

source: །ནོར་ཉམས་རྒ་བས་ཉེན་ཅིང་སྤང་བ་ན།
en: Yet when the wealth is gone, one becomes a beggar, miserable in old age;

source: །དེ་ཚེ་དགའ་བར་མི་འགྱུར་བྱ་རྒོད་བཞིན།
en: At that point, just like a vulture, one becomes disliked.

source: །རྫས་ལྡན་གཟུགས་མཆོག་ལྡན་ཚེ་དཔོན་པོ་བཞིན།
en: “When one is powerful, rich, and handsome, one is like a lord;

source: །ཕྲད་ན་སྡུག་ཅིང་དབང་པོ་དགའ་བར་བྱེད།
en: People like to meet such a being, and one pleases their senses.

source: །དགའ་ན་སྡུག་བསྔལ་ཉེན་ཅིང་ནོར་ཟད་ན།
en: Yet when one is old, suffering from disease, and all wealth is spent,

source: །དེ་ཚེ་འདོད་པར་མི་འགྱུར་འཆི་བདག་བཞིན།
en: One becomes as disagreeable as death.

source: །རྒ་བས་རྒ་བྱས་ན་ཚོད་ཡོལ་གྱུར་ན།
en: “When one is old and youth has passed,

source: །སྡོང་པོ་གནམ་ལྕགས་ཀྱིས་ནི་བཅོམ་པ་བཞིན།
en: Like a tree struck by lightning,

source: །རྒ་བས་འཁོགས་ན་འཇིགས་བཅས་ཁང་རུལ་འདྲ།
en: One is worn out and terrifying to others, like a ruined house.

source: །རྒ་ལས་བྱུང་བ་ཐུབ་པ་མྱུར་དུ་སྨྲོས།
en: Sage, quick, tell us how to avoid old age!

source: །བུད་མེད་སྐྱེས་པའི་ཚོགས་རྣམས་རྒ་བས་སྐེམས།
en: “Old age withers men and women,

source: །མ་ལུའི་འཁྲི་ཤིང་སཱ་ལའི་ནགས་སྟུག་བཞིན།
en: Just as the mālu ivy does to a thick sāl forest.

source: །རྒ་བས་བརྩོན་འགྲུས་རྩལ་དང་ཤུགས་འཕྲོག་སྟེ།
en: Old age robs one’s diligence, energy, and power,

source: །དཔེར་ན་སྐྱེས་བུ་འདམ་དུ་བྱིང་བ་བཞིན།
en: Like a person caught in a swamp.

source: །རྒ་བས་གཟུགས་སྡུག་གཟུགས་ནི་མི་སྡུག་བྱེད།
en: “Old age makes the beautiful person ugly;

source: །རྒ་བས་གཟི་བརྗིད་འཕྲོག་ཅིང་མཐུ་སྟོབས་འཕྲོག །རྒ་བས་བདེ་བ་འཕྲོག་ཅིང་བརྙས་པར་བྱེད།
en: Old age steals one’s splendor and robs one’s power. Old age takes your happiness and defeats you;

source: །རྒ་བས་འཆི་བྱེད་རྒ་བས་མདངས་ཀྱང་འཕྲོག །ནད་བརྒྱ་མང་དང་ནད་ཐིབས་སྡུག་བསྔལ་གྱིས།
en: Old age brings death and destroys your vital force. “There are hundreds of diseases, and being struck by sickness

source: །འགྲོ་བ་གཙེས་ཏེ་མི་ཡིས་རི་དགས་བཞིན།
en: Brings torment to beings, like deer tormented by forest fire.

source: །རྒ་དང་ན་བས་བཅོམ་པའི་འགྲོ་ལྟོས་ལ།
en: Look at those beings that are overcome by old age and sickness,

source: །སྡུག་བསྔལ་ལས་ནི་འབྱུང་བ་མྱུར་ཤོད་ཅིག །དཔེར་ན་དགུན་སྨད་རླུང་དང་ཁ་བ་ཆེ། །རྩྭ་ཤིང་གེལ་བ་ནགས་སྨན་མདངས་ཀྱང་འཕྲོག །དེ་ལྟར་ནད་འདི་འགྲོ་བའི་མདངས་འཕྲོག་ཅིང་། །དབང་པོ་གཟུགས་དང་སྟོབས་ནི་ཉམས་པར་བྱེད།
en: And, quick, explain how to be free of suffering! “Just as the heavy snow during winter Steals all life from grass, trees, and herbs, So, alas, do sickness and old age rob the vitality of beings And destroy their faculties, bodies, and strength.

source: །ནོར་འབྲུ་ནོར་ཆེན་ཐ་མར་ཟད་པར་བྱེད།
en: “Old age and disease exhaust all stores of wealth and grain;

source: །ནད་ནི་རྟག་ཏུ་འགྲོ་བ་བརྙས་པར་བྱེད།
en: They bring great anguish to beings.

source: །གནོད་པ་བྱེད་ཅིང་སྡུག་ལ་སྡང་བར་བྱེད།
en: They create resentment and bring animosity among loved ones;

source: །ཡོངས་སུ་གདུང་བྱེད་མཁའ་ལས་ཉི་མ་བཞིན།
en: They torment everyone intensely, like the sun in the sky.

source: །འཆི་དང་འཕོ་དང་འཆི་འཕོ་དུས་བྱེད་པ།
en: “When the time of passing away has arrived,

source: །ཕངས་ཤིང་སྡུག་པའི་སྐྱེ་བོ་རྟག་ཏུ་འབྲལ།
en: One is always separated from one’s favorite possessions and loved ones.

source: །ཕྱིར་མི་འོང་ཞིང་འཕྲད་པར་འགྱུར་མ་ཡིན།
en: There will be no returning or meeting again,

source: །ཤིང་ལས་ལོ་འབྲུ་འདྲ་ཞིང་ཀླུ་ཡི་རྒྱན་དང་མཚུངས།
en: Just as fruits or leaves taken by the river never meet the tree again.

source: །ཞི་བ་དབང་ཡོད་པ་དག་དབང་མེད་བྱེད།
en: “Death makes the powerful helpless;

source: །འཆི་བ་འཕྲོག་བྱེད་ཆུ་བོས་ཤིང་དེད་བཞིན།
en: Death robs everyone, like a river carrying off a tree.

source: །མི་ནི་གཉིས་མིན་གྲོགས་མེད་གཅིག་པུར་འགྲོ།
en: One must proceed alone, without friend or company;

source: །རང་ལས་འབྲས་བུ་ལྡན་པས་དབང་ཡང་མེད།
en: One is powerless but to follow the results of one’s actions.

source: །འཆི་བས་སྲོག་ཆགས་བརྒྱ་ཕྲག་མང་འཛིན་ཏེ།
en: “Death devours beings by the hundreds,

source: །འབྱུང་པོའི་ཚོགས་ལ་རྒྱ་མཚོའི་ཆུ་སྲིན་བཞིན།
en: Like a sea monster devouring numerous beings,

source: །ཀླུ་ལ་མཁའ་ལྡིང་གླང་ཆེན་སེང་གེ་འདྲ།
en: Or like a garuḍa devouring a nāga, or an elephant catching a lion,

source: །རྩྭ་རྩི་འབྱུང་པོའི་ཚོགས་ལ་མེ་དང་མཚུངས།
en: Or how a fire devours plants, herbs, and living creatures.

source: །སྐྱོན་བརྒྱ་མང་པོ་འདི་འདྲ་འདི་དག་ལས།
en: “To liberate beings from these hundreds of calamities,

source: །འགྲོ་བ་སྒྲོལ་ཞེས་ཁྱོད་ཀྱིས་སྨོན་ལམ་བཏབ།
en: Thus you made your aspiration.

source: །སྔོན་གྱི་སྨོན་ལམ་སྤྱོད་པ་དེ་དྲན་བྱོས།
en: Now remember that aspiration of bygone times;

source: །ཁྱོད་ནི་མངོན་པར་འབྱུང་བའི་དུས་ལ་བབ།
en: The time for leaving your home has come.”

source: །གང་ཚེ་བུད་མེད་ཚོགས་ནི་རབ་དགའ་ཞིང་།
en: While the group of delighted women

source: །སིལ་སྙན་དག་གིས་ཐུབ་ཆེན་སློང་བྱེད་པ།
en: Are waking up the Great Sage with their music,

source: །དེ་ཚེ་བདེ་བར་གཤེགས་པ་རྣམས་ཀྱི་མཐུས།
en: At this time, through the power of the thus-gone ones,

source: །ཚིགས་བཅད་སྣ་ཚོགས་སིལ་སྙན་སྒྲ་ལས་བྱུང་།
en: These wonderful verses come out from the sound of the instruments:

source: །འདུས་བྱས་ཐམས་ཅད་མྱུར་དུ་འཇིག་པ་སྟེ།
en: “Everything compounded quickly disintegrates;

source: །མཁའ་ལ་གློག་རྒྱུན་རིང་དུ་མི་གནས་བཞིན།
en: Nothing lasts longer than a flash of lightning in the sky.

source: །ཁྱོད་ཀྱི་དུས་འདི་ཉེ་བར་གནས་གྱུར་གྱིས། །བརྟུལ་ཞུགས་བཟང་པོ་མངོན་འབྱུང་དུས་ལ་བབ།
en: Your time has now come—The time for leaving home, Disciplined One!

source: །འདུ་བྱེད་མི་རྟག་བརྟན་པ་མ་ཡིན་ཏེ།
en: “Conditioned things are impermanent and without stability;

source: །རྫ་སོ་མ་བཏང་ལྟ་བུར་འཇིག་པའི་བདག །གཞན་གྱི་རྫས་ནི་བརྙན་པོ་བྱས་དང་མཚུངས།
en: Their nature is to break, like an unbaked earthen vase. They are like things on loan from another,

source: །བྱེ་མའི་གྲོང་ཁྱེར་ལྟ་བུར་རིང་མི་ཐོགས།
en: Or a city of sand, so short-lived are they.

source: །འདུ་བྱེད་འདི་དག་འཇིག་པའི་ཆོས་ཅན་ཏེ།
en: “All these conditioned things are impermanent by nature.

source: །དབྱར་གྱི་ཞལ་ཞལ་ཇི་ལྟར་འགོགས་པ་བཞིན།
en: Like mud plaster applied during the rains,

source: །ཆུ་ངོགས་བྱེ་མ་ཡོད་པ་འདྲ་བ་སྟེ།
en: Or the sandy banks of the river,

source: །རྐྱེན་ལ་རག་ལས་རང་བཞིན་ཉམ་ཆུང་བ།
en: They depend on conditions and have a feeble nature.

source: །འདུ་བྱེད་མར་མེའི་འོད་འཕྲོ་འདྲ་བ་སྟེ།
en: “Conditioned things are like the light of a candle:

source: །མྱུར་དུ་འབྱུང་ཞིང་འགག་པའི་ཆོས་ཅན་ཡིན།
en: They have the nature of quickly coming and going.

source: །རླུང་དང་མཚུངས་པར་རིང་དུ་མི་གནས་ལ།
en: Like the wind, they do not remain;

source: །དབུ་བ་ལྟ་བུར་ཉམ་ཆུང་སྙིང་པོ་མེད།
en: Like foam, they are feeble and insubstantial.

source: །འདུ་བྱེད་གཡོ་བ་མེད་ཅིང་སྟོང་པ་སྟེ།
en: “Conditioned things are inert and empty;

source: །བརྟགས་ན་ཆུ་ཤིང་དག་གི་ཕུང་པོ་འདྲ།
en: When examined they are like the stem of the plantain tree.

source: །སྒྱུ་མ་ལྟ་བུར་སེམས་ནི་རྨོངས་པར་བྱེད།
en: They are like an illusion that deceives the mind;

source: །ལག་བཅངས་སྟོངས་པས་བྱིས་པ་བྲིད་དང་མཚུངས།
en: They are like an empty fist that tricks children.

source: །འདུས་བྱས་གྱུར་པ་ཐམས་ཅད་རྒྱུ་དག་དང་། །རྐྱེན་རྣམས་ཀྱིས་ནི་རབ་ཏུ་འབྱུང་བ་སྟེ།
en: “All conditioned things come about Based on causes and conditions.

source: །གཅིག་གིས་གཅིག་རྒྱུ་བྱས་ཏེ་བརྟེན་ནས་བྱུང་།
en: One causing the other, they arise in dependence,

source: །བྱིས་པའི་སྐྱེ་བོས་འདི་འདྲ་དེ་མ་རྟོགས།
en: Yet all the childish beings do not recognize this.

source: །དཔེར་ན་གྲེས་མ་མུན་ཛ་བརྟེན་བྱས་ལ།
en: “Just as valvaja grass depends on muñja grass

source: །རྩོལ་བའི་སྟོབས་ཀྱིས་ཐག་པར་སྒྱུར་བ་དང་། །ཟོ་ཆུན་རྒྱུད་མོ་འཁོར་ལོར་བཅས་པ་ཡང་།
en: To give a rope proper strength, Or just as a bucket in a well depends on a winch—

source: །དེ་དག་རེ་རེས་འགྲུབ་པར་འགྱུར་བ་མེད།
en: One unable to function without the other—

source: །དེ་ལྟར་སྲིད་པའི་ཡན་ལག་ཀུན་གྲུབ་པ།
en: “So too function the twelve links of dependent origination.

source: །གཞན་དང་གཞན་ཚོགས་པ་ལ་བརྟེན་ནས་ནི།
en: Being all in mutual dependence,

source: །དེ་དག་སོ་སོ་རེ་རེར་འགྲུབ་པར་འགྱུར།
en: One thing follows after another,

source: །སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་མི་དམིགས།
en: And it cannot be seen where one thing ends and the other begins.

source: །ས་བོན་ཡོད་ན་མྱུ་གུ་ཇི་བཞིན་ཏེ།
en: “When you have a seed, a sprout can grow,

source: །ས་བོན་གང་ཡིན་མྱུ་གུ་དེ་ཉིད་མིན།
en: Yet the seed is not the sprout.

source: །དེ་ལས་གཞན་མིན་དེ་ཡང་མ་ཡིན་ཏེ།
en: Still it is not different;

source: །དེ་ལྟར་རྟག་མིན་ཆད་མིན་ཆོས་ཉིད་དོ།
en: In this way the true nature knows no permanence or impermanence.

source: །མ་རིག་པ་ཡི་འདུ་བྱེད་རྐྱེན་ཡིན་ཏེ།
en: “Formative factors have ignorance for their cause;

source: །འདུ་བྱེད་དེ་ཡང་ཡང་དག་ཉིད་དུ་མེད།
en: Formative factors do not truly exist.

source: །མ་རིག་པ་དང་འདུ་བྱེད་དེ་དག་ཀྱང་།
en: Ignorance and formative factors

source: །རང་བཞིན་སྟོང་སྟེ་གཡོ་བ་མེད་པ་ཡིན།
en: Are naturally empty and inert.

source: །རྒྱ་ལས་རྒྱ་ཡི་འབུར་ནི་སྣང་མོད་ཀྱི།
en: “The seal makes the mark of the seal appear,

source: །རྒྱ་དེ་འཕོས་པར་གྱུར་པའང་ཡོད་མ་ཡིན།
en: Yet the seal itself was not transferred anywhere.

source: །དེ་ལ་དེ་མེད་གཞན་ལས་མ་ཡིན་ཏེ།
en: It is not in the mark, yet it is also not elsewhere;

source: །དེ་ལྟར་འདུས་བྱས་རྟག་མེད་ཆད་པ་མེད།
en: In this way the formative factors are beyond annihilation and permanence.

source: །མིག་དང་གཟུགས་ལ་བརྟེན་པ་བྱས་ནས་སུ།
en: “It is based on the eye and form

source: །མིག་གི་རྣམ་པར་ཤེས་པ་འདིར་འབྱུང་ཡང་།
en: That the eye consciousness appears.

source: །མིག་ནི་གཟུགས་ལ་བརྟེན་པ་མ་ཡིན་ལ།
en: Yet the form is not dependent on the eye,

source: །གཟུགས་ཀྱང་མིག་ལ་འཕོ་བ་ཡོད་མ་ཡིན།
en: Nor is the form transferred to the eye.

source: །འདི་དག་བདག་མེད་མི་སྡུག་ཆོས་ཅན་ཡང་།
en: “Although all of this is without a self and is repulsive,

source: །དེ་དག་བདག་དང་སྡུག་པར་བརྟགས་པ་སྟེ།
en: Beings perceive it as having a self and as beautiful.

source: །ནོར་པ་ཡང་དག་མ་ཡིན་བརྟགས་ཡིན་ཡང་།
en: Although that is a mistaken and corrupt imputation,

source: །དེ་ལས་མིག་གི་རྣམ་པར་ཤེས་པ་འབྱུང་།
en: The eye consciousness arises from it.

source: །རྣམ་པར་ཤེས་པ་འགགས་ནས་འབྱུང་འགྱུར་ཏེ།
en: “The consciousness ceases and rearises.

source: །མཁས་པས་སྐྱེ་དང་འཇིག་པ་རྣམ་པར་མཐོང་།
en: The practitioner observes this arising and ceasing of consciousness:

source: །གང་དུ་མ་སོང་གང་ནས་འོངས་པ་མིན།
en: It goes nowhere and it does not come from anywhere.

source: །རྣལ་འབྱོར་པས་ནི་སྟོང་པ་སྒྱུ་ལྟར་མཐོང་།
en: The practitioner perceives consciousness as empty and illusory.

source: །དཔེར་ན་གཙུབ་ཤིང་དང་ནི་གཙུབ་སྟན་དང་། །ལག་པས་རྩོལ་བ་བྱས་པ་གསུམ་ཚོགས་པ།
en: “Since the combination of these three is needed—The lower and upper pieces of wood, and the action of the hands—

source: །དེ་ལ་བརྟེན་ནས་མེ་ནི་འབྱུང་འགྱུར་ཏེ།
en: A fire is born in dependence on conditions.

source: །བྱུང་ནས་རིང་པོར་མི་ཐོགས་འགག་པར་འགྱུར།
en: It is born, fulfills its purpose, and quickly ceases.

source: །དེ་ནས་མཁས་པ་ལ་ལས་བརྟགས་བྱས་ཏེ།
en: “In this way some scholars investigate:

source: །འདི་ནི་གང་ནས་འོངས་ལ་གར་སོང་ཞེས།
en: ‘Where does this come from and where does it proceed?’

source: །ཕྱོགས་དང་ཕྱོགས་མཚམས་ཀུན་ཏུ་བརྟགས་བྱས་ནས།
en: They check in all directions,

source: །དེ་ཡི་འོང་བའམ་འགྲོ་བ་མི་དམིགས་སོ།
en: And find that nothing comes and nothing goes.

source: །ཕུང་པོ་དག་དང་སྐྱེ་མཆེད་ཁམས་རྣམས་ཀྱི།
en: “The conditions for the aggregates, the sense fields, and the elements

source: །རྐྱེན་ནི་མ་རིག་པ་དང་སྲེད་དང་ལས།
en: Are ignorance, craving, and karma.

source: །དེ་དག་ཚོགས་པ་སེམས་ཅན་ཞེས་བརྗོད་ཀྱང་།
en: When all of these assemble, that is called a sentient being,

source: །དེ་ནི་དམ་པའི་དོན་དུ་དམིགས་སུ་མེད།
en: Although ultimately nothing is there.

source: །མཆུ་དང་ལྐོག་མ་རྐན་ལ་བརྟེན་ནས་ནི།
en: “Based on the lips, throat, palate, and tongue,

source: །ལྕེ་བསྒྱུར་བ་ལས་ཡི་གེའི་སྒྲ་འབྱུང་ཡང་།
en: The sounds of syllables are produced.

source: །ལྐོག་མར་བརྟེན་ནས་མ་ཡིན་རྐན་ལས་མིན།
en: This is not so with just the throat or the palate;

source: །རེ་རེ་ལ་ནི་ཡི་གེ་དམིགས་སུ་མེད།
en: No sound can be found in them individually.

source: །ཚོགས་པ་དེ་ལ་བརྟེན་ནས་ངག་དེ་ནི།
en: “Speech occurs based on all of these things coming together;

source: །ཡིད་ཀྱི་བློ་ཡི་དབང་གིས་འབྱུང་མོད་ཀྱི།
en: It emerges based on the power of mind and intelligence.

source: །ཡིད་དང་ངག་ནི་མི་སྣང་གཟུགས་མེད་དེ།
en: Yet mind and speech are by nature invisible;

source: །ནང་དང་ཕྱི་རོལ་ན་ཡང་དམིགས་སུ་མེད།
en: They are nowhere to be found, inside or outside.

source: །མཁས་པས་ངག་སྐད་སྒྲ་དང་དབྱངས་རྣམས་ཀྱི། །སྐྱེ་དང་འཇིག་ལ་རྣམ་པར་བརྟགས་བྱས་ན། །དེ་ཚེ་ངག་ཀུན་བྲག་ཅ་ལྟ་བུ་དང་། །སྐད་ཅིག་པ་དང་སྙིང་པོ་མེད་པར་མཐོང་།
en: “When the learned ones analyze the coming and going Of speech, voices, sounds, and tunes, They see that all speech is like an echo, Momentary and without substance.

source: །དཔེར་ན་ཤིང་དང་རྒྱུད་ལ་བརྟེན་བྱས་ལ།
en: “Sound is based on wood and strings

source: །ལག་པས་རྩོལ་བ་བྱས་པ་གསུམ་ཚོགས་ན།
en: Meeting with the movements of the hands.

source: །སྒྲ་སྙན་པི་བང་གླིང་བུ་ལ་སོགས་པ། །
en: Due to these three things, sounds can emerge

source: དེ་དག་ལས་ནི་སྒྲ་ཡང་འབྱུང་བར་འགྱུར།
en: From instruments such as the melodious lute.

source: །ཕྱོགས་དང་ཕྱོགས་མཚམས་ཀུན་ཏུ་བརྟགས་བྱས་ན།
en: They may search in all directions,

source: །སྒྲ་ཡི་འོང་བའམ་འགྲོ་བ་མི་དམིགས་སོ། །
en: Yet never find the origin of sound or its destination.

source: དེ་ལྟར་རྒྱུ་དག་དང་ནི་རྐྱེན་རྣམས་ལས། ། འདུ་བྱེད་གྱུར་པ་ཐམས་ཅད་བྱུང་བ་སྟེ།
en: “This is how all compounded phenomena appear, Based on causes and conditions.

source: །ཡང་དག་མཐོང་བའི་རྣལ་འབྱོར་པ་ཡིས་ནི། །འདུ་བྱེད་སྟོང་པ་གཡོ་བ་མེད་པར་མཐོང་།
en: The practitioner, by observing the true nature of conditioned things, Sees that these things are all empty and inert.

source: །ཕུང་པོ་དག་དང་སྐྱེ་མཆེད་ཁམས་རྣམས་ནི།
en: “The aggregates, sense fields, and elements

source: །ནང་ཡང་སྟོང་ལ་ཕྱི་རོལ་སྟོང་པ་སྟེ།
en: Are empty within and empty without;

source: །ཐམས་ཅད་བདག་གིས་དབེན་ཞིང་གནས་མེད་ལ།
en: They all lack a self and do not abide.

source: །ཆོས་ཀྱི་མཚན་ཉིད་ནམ་མཁའི་ངོ་བོ་ཉིད།
en: Everything is essentially like space.

source: །ཆོས་ཀྱི་མཚན་ཉིད་འདི་འདྲ་འདི་དག་ནི།
en: “That everything is this way,

source: །མར་མེ་མཛད་པ་མཐོང་ནས་ཁྱོད་ཀྱིས་རྟོགས།
en: You realized when you met Dīpaṃkara.

source: །ཇི་ལྟར་ཉིད་ཀྱིས་རྗེས་སུ་རྟོགས་པ་ལྟར།
en: That which you understood, exactly as it is,

source: །དེ་བཞིན་ལྷ་མིར་བཅས་པ་རྟོགས་པར་གྱིས། །
en: You must now make gods and humans comprehend.
